// UTF-8 text

// 85: 1-94
const unsigned char *arib_addchar85_table[] =
{
	"㐂", "𠅘", "份", "仿", "侚", "俉", "傜", "儞",
	"冼", "㔟", "匇", "卡", "卬", "詹", "𠮷", "呍",
	"咖", "咜", "咩", "唎", "啊", "噲", "囤", "圳",
	"圴", "塚", "墀", "姤", "娣", "婕", "寬", "﨑",
	"㟢", "庬", "弴", "彅", "德", "怗", "恵", "愰",
	"昤", "曈", "曙", "曺", "曻", "桒", "鿄", "椑",
	"椻", "橅", "檑", "櫛", "𣏌", "𣏾", "𣗄", "毱",
	"泠", "洮", "海", "涿", "淊", "淸", "渚", "潞",
	"濹", "灤", "𤋮", "𤋮", "煇", "燁", "爀", "玟",
	"玨", "珉", "珖", "琛", "琡", "琢", "琦", "琪",
	"琬", "琹", "瑋", "㻚", "畵", "疁", "睲", "䂓",
	"磈", "磠", "祇", "禮", "鿆", "䄃"
};

// 86: 1-43
const unsigned char *arib_addchar86_table[] =
{
	//95
	"鿅", "秚", "稞", "筿", "簱", "䉤", "綋", "羡",
	"脘", "脺", "舘", "芮", "葛", "蓜", "蓬", "蕙",
	"藎", "蝕", "蟬", "蠋", "裵", "角", "諶", "跎",
	"辻", "迶", "郝", "鄧", "鄭", "醲", "鈳", "銈",
	"錡", "鍈", "閒", "雞", "餃", "饀", "髙", "鯖",
	"鷗", "麴", "麵" 
};

// 90: 48-84
const unsigned char *arib_addchar90_48_table[] =
{
	"[HV]", "[SD]", "[Ｐ]", "[Ｗ]", "[MV]", "[手]", "[字]", "[双]",
	"[デ]", "[Ｓ]", "[二]", "[多]", "[解]", "[SS]", "[Ｂ]", "[Ｎ]",
	"■", "●", "[天]", "[交]", "[映]", "[無]", "[料]", "[鍵]",
	"[前]", "[後]", "[再]", "[新]", "[初]", "[終]", "[生]", "[販]",
	"[声]", "[吹]", "[PPV]", "㊙", "ほか"
};
